[
  {
    "title": "Who can benefit from the Contract Management service?",
    "paragraph": "Our Contract Management service is tailored for professionals in the construction industry, including general contractors, subcontractors, project managers, and legal teams. It helps manage contracts efficiently, track compliance, and streamline the signing process."
  },

  {
    "title": "What features does the Contract Management service offer?",
    "paragraph": "Our Contract Management service includes tools for creating, tracking, and managing contracts, integrated e-signature capabilities for secure online signing, real-time compliance tracking, and automated reminders for important deadlines. It also offers integration with other project management tools for a seamless workflow."
  },
  {
    "title": "Are there any additional fees?",
    "paragraph": "There are no hidden fees with our Contract Management service. The cost is included in your chosen pricing plan. Any additional charges, if applicable, will be clearly communicated in your plan details."
  },
  {
    "title": "What plan and payment options are available?",
    "paragraph": "We offer a variety of pricing plans to fit different needs, including options for monthly or annual subscriptions. For detailed information on our plans and payment options, please visit our Pricing page."
  },
  {
    "title": "Can I upgrade or downgrade my plan at any time?",
    "paragraph": "Yes, you can upgrade or downgrade your plan at any time according to your needs. Contact our support team to adjust your subscription as required."
  },
  {
    "title": "How secure is the e-signature process?",
    "paragraph": "Our e-signature process uses advanced encryption and identity verification to ensure that all contract signings are secure and legally binding. We adhere to industry standards for data protection and privacy."
  },
  {
    "title": "Can I track contract changes and history?",
    "paragraph": "Yes, our Contract Management service provides a detailed audit trail of all contract changes and history. This feature ensures transparency and helps you keep track of amendments and approvals."
  }
]
