[
  {
    "title": "What services does Schesti Technologies, Inc. provide for the construction industry?",
    "paragraph": "Schesti Technologies offers a full suite of construction management solutions, including tools for estimates, takeoffs, scheduling, meetings, contract management, and networking. Our platform is designed to streamline the entire project lifecycle, from planning to completion."
  },
  {
    "title": " How does Schesti Technologies handle construction estimates?",
    "paragraph": "Our platform simplifies the process of creating accurate construction estimates with both manual and AI-driven tools. You can generate detailed estimates based on material costs, labor, and project scope, ensuring accuracy and efficiency."
  },
  {
    "title": "Can I customize my estimates within the Schesti platform?",
    "paragraph": "Yes! Schesti Technologies allows you to fully customize your estimates based on project requirements, material specifications, labor rates, and more. You can also store templates for future use."
  },
  {
    "title": "How does AI assist with construction estimates?",
    "paragraph": "Our AI-powered estimation tool automates much of the data gathering and analysis, reducing human error and ensuring faster, more accurate estimates. It can predict potential costs based on similar past projects and real-time data."
  },
  {
    "title": " What is construction takeoff, and how can Schesti Technologies help with it?",
    "paragraph": "Construction takeoff is the process of measuring and calculating quantities from design plans, which are then used to determine material needs and project costs. Schesti offers both manual and AI-driven takeoff tools to enhance speed and accuracy."
  },
  {
    "title": "How does the AI-powered takeoff work?",
    "paragraph": "Our AI-powered takeoff automatically scans construction plans, identifies materials, and generates quantity lists in minutes. This eliminates the need for manual counting and reduces the risk of errors."
  },
  {
    "title": "Can I perform manual takeoffs with Schesti Technologies?",
    "paragraph": "Yes! Schesti Technologies supports both manual and automated takeoff processes. You can input measurements manually if preferred or when needed for special circumstances."
  },
  {
    "title": "How can Schesti Technologies help with construction scheduling?",
    "paragraph": "Our platform provides robust scheduling tools that help you plan every phase of the project. You can assign tasks, track progress in real-time, set milestones, and integrate it with other project management tools."
  },
  {
    "title": "Does Schesti Technologies offer real-time schedule updates?",
    "paragraph": "Yes, we offer real-time updates to keep everyone on the same page. You can notify your team of any changes instantly and adjust the schedule as needed, minimizing delays and improving coordination."
  },
  {
    "title": "Can I share the construction schedule with clients or other stakeholders?",
    "paragraph": "Absolutely. Schesti Technologies allows you to share your project schedules with clients, architects, and stakeholders via email or directly through the platform for transparency and collaboration."
  },
  {
    "title": "How can Schesti Technologies assist with construction meetings?",
    "paragraph": "Our platform streamlines meeting scheduling and management by providing tools to create agendas, set reminders, and track meeting outcomes. You can also store meeting notes, assign action items, and share details with team members."
  },
  {
    "title": "Can I send automated meeting reminders through Schesti Technologies?",
    "paragraph": "Yes, Schesti lets you send automated reminders for upcoming meetings, ensuring everyone is aware of the schedule and prepared to attend."
  },
  {
    "title": "How can I track the outcomes and action items from meetings?",
    "paragraph": "You can assign tasks, set deadlines, and track completion of action items discussed in meetings directly within the platform. This ensures accountability and keeps the project moving forward efficiently."
  },
  {
    "title": "What contract management features does Schesti Technologies provide?",
    "paragraph": "Schesti offers a full contract management suite, allowing you to create, store, and manage contracts digitally. You can send contracts for electronic signatures, track changes, and ensure all parties are aligned on project terms."
  },
  {
    "title": "Can contracts be signed electronically?",
    "paragraph": "Yes, Schesti Technologies supports electronic contract signatures, which speeds up the contract approval process, reduces paperwork, and ensures faster project start times."
  },
  {
    "title": "Does the platform track contract changes and amendments?",
    "paragraph": "Absolutely. Our contract management system keeps a record of all contract changes and amendments, ensuring complete transparency and traceability throughout the project lifecycle."
  },
  {
    "title": "What networking features does Schesti Technologies offer for construction professionals?",
    "paragraph": "Our platform includes a built-in social network specifically for construction professionals. You can connect with industry peers, share updates, post job opportunities, and discuss industry trends."
  },
  {
    "title": "Can I post project updates and job offers on Schesti Technologies' platform?",
    "paragraph": "Yes, our social media features allow you to post project updates, share progress with your network, and even list job offers to hire subcontractors or skilled labor."
  },
  {
    "title": " What happens if my payment fails?",
    "paragraph": "If your payment fails, you will be notified via email and given a chance to update your payment method. You may be given a grace period to resolve the issue before your account access is restricted."
  },
  {
    "title": "Does Schesti Technologies offer refunds?",
    "paragraph": "Refunds may be granted on a case-by-case basis. Please refer to our Terms and Conditions for more detailed information regarding refunds."
  },
  {
    "title": "What type of data does Schesti Technologies collect?",
    "paragraph": "Schesti Technologies collects data necessary for providing and improving our services, such as user details, project data, payment information, and usage metrics. We do not sell or share this data with unauthorized third parties."
  },
  {
    "title": "How does Schesti Technologies use my data?",
    "paragraph": " We use your data to enhance your experience on the platform, ensure accurate project management, and improve our services. Data is also used for analytics, marketing (with your consent per Terms and conditions), and customer support."
  },
  {
    "title": "Does Schesti Technologies share my data with third parties?",
    "paragraph": " We do not share your personal data with third parties without your explicit consent, except where necessary for service providers assisting us in delivering our services (such as payment processors)."
  },
  {
    "title": "Does Schesti Technologies use cookies?",
    "paragraph": "Yes, Schesti Technologies uses cookies to improve your browsing experience, analyze site usage, and assist with marketing efforts. Cookies help us remember your preferences and optimize the platform for your needs. https://schesti.com/terms-conditions "
  },
  {
    "title": "Can I control or disable cookies on Schesti.com?",
    "paragraph": "Yes, you can control or disable cookies via your browser settings."
  },
  {
    "title": "What types of cookies does Schesti Technologies use?",
    "paragraph": "We use essential cookies for platform functionality, performance cookies to understand usage, and marketing cookies for targeted advertisements. You can view a complete list in our Cookie Policy."
  },
  {
    "title": "How can I view or change my cookie preferences?",
    "paragraph": "You can view or update your cookie preferences from the 'Cookie Settings' link found on our website’s footer. Additionally, most browsers provide the ability to manage or block cookies through their settings."
  },
  {
    "title": "How does Schesti Technologies protect my privacy?",
    "paragraph": "Schesti Technologies is committed to protecting your privacy and follows industry-standard security measures to safeguard your personal information. Our Privacy Notice outlines the type of data we collect and how it is used. https://schesti.com/privacy "
  },
  {
    "title": " Where can I find Schesti Technologies’ Privacy Notice?",
    "paragraph": " Our Privacy Notice is available at the bottom of our website or by following this link to understand how we collect, use, and protect your data. https://schesti.com/privacy "
  },
  {
    "title": "Can I request to delete my data?",
    "paragraph": "Yes, under certain circumstances, you have the right to request the deletion of your data. Please contact our support team, and we will process your request in accordance with applicable laws."
  },
  {
    "title": "How does Schesti Technologies handle personal data of EU residents?",
    "paragraph": "For EU residents, Schesti Technologies complies with the General Data Protection Regulation (GDPR), providing full rights to access, modify, or delete personal data. You can request details or manage your preferences by contacting us."
  },
  {
    "title": "Is my use of Schesti Technologies covered by legal agreements?",
    "paragraph": "Yes, by using Schesti Technologies, you agree to our legal agreements, including our Terms and Conditions, Privacy Notice, and other relevant policies."
  },
  {
    "title": "What happens if there’s a legal dispute between me and Schesti Technologies?",
    "paragraph": "In the event of a legal dispute, we encourage mediation or arbitration as outlined in our Terms and Conditions. Our goal is to resolve any disputes amicably and fairly, you could email us at Legal@schesti.com "
  },
  {
    "title": "Can I contact Schesti Technologies for legal inquiries?",
    "paragraph": "Yes, for any legal inquiries, you can reach us at our designated legal contact email available on the platform: Legal@schesti.com. Our legal team will respond to your questions promptly."
  },
  {
    "title": "Does Schesti Technologies provide legal advice on construction contracts?",
    "paragraph": "While Schesti Technologies provides tools to manage and draft contracts, we do not offer legal advice. We recommend consulting with a legal professional for contract-related concerns."
  },
  {
    "title": "Where can I find Schesti Technologies’ Terms and Conditions?",
    "paragraph": "Our Terms and Conditions can be found on our website or accessed directly via this link. These terms outline your rights, responsibilities, and how to use our platform. https://schesti.com/terms-conditions "
  },
  {
    "title": "What should I know before accepting the Terms and Conditions?",
    "paragraph": "Before accepting our Terms and Conditions, ensure you understand the guidelines for using our services, payment obligations, intellectual property rights, and limitations of liability."
  },
  {
    "title": "How often are the Terms and Conditions updated?",
    "paragraph": "We update our Terms and Conditions periodically to reflect changes in our services or legal requirements. You will be notified via email or platform notifications when updates occur."
  },
  {
    "title": "Can I negotiate or modify the Terms and Conditions?",
    "paragraph": " Our Terms and Conditions are standardized for all users to maintain fairness and consistency. While they cannot be modified, you are welcome to contact us with any concerns or clarifications at Legal@schesti.com "
  }
]
